Revit 2027 API
DeleteWorksetSettings.DeleteWorksetOption Property
 The current delete workset option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DeleteWorksetOption DeleteWorksetOption { get; set; }
Public Property DeleteWorksetOption As DeleteWorksetOption
	Get
	Set
public:
property DeleteWorksetOption DeleteWorksetOption {
	DeleteWorksetOption get ();
	void set (DeleteWorksetOption value);
}
member DeleteWorksetOption : DeleteWorksetOption with get, set
Property Value
DeleteWorksetOption
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DeleteWorksetSettings Class
Autodesk.Revit.DB Namespace